---
kind: property
id: P:Autodesk.Revit.DB.ParameterValueProvider.Parameter
zh: 参数、共享参数
source: html/3f40b842-1ea9-534a-7e77-b47dc589bb3a.htm
---
# Autodesk.Revit.DB.ParameterValueProvider.Parameter Property

**中文**: 参数、共享参数

The parameter used to provide a string, integer, double-precision, or ElementId
 value on request for a given element.

## Syntax (C#)
```csharp
public ElementId Parameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null